

## ***연계 시스템**

 1. 송신 시스템/ 수신 시스템/ 중계 서버
 2. 연계 요구사항 주요 분석기법
 3. 인터뷰/ 체크리스트/ 브레인스토밍/ 설문지/ 델파이 기법
  

*** 델파이 기법**
- 전문가들의 의견수립, 중재, 타협의 방식으로 반복적인 피드백을 통한 하향식 의견 도출 방법으로 문제를 해결하는 기법

*** WSDL**
- 웹 서비스명, 제공 위치, 메세지 포맷, 프로토콜 정보 등 웹 서비스에 대한 상세 정보를 기술한 파일

*** 인스턴스**
- 객체지향 프로그래밍에서 해당 클래스의 구조로 컴퓨터에 저장 공간에서 할당된 실체

*** SOAP**
- HTTP, HTTPS, SMTP 등을 사용하여 XML기반의 메세지를 네트워크 상태에서 교환하는 프로토콜

*** UDDI**
- 웹 서비스에 대한 정보인 WSDL을 등록하고 검색하기 위한 저장소로 공개적으로 접근, 검색이 가능한 레지스트리

*** JSON**
- 비동기 브라우저/ 서버 통신(AJAX)을 위해 "속성-값 쌍","키-값 쌍" 으로 이루어진 데이터 오브젝트를 전달하기 위해 인간이 읽을 수 있는 텍스트를 사용하는 개방형 표준 포맷

*** EAI(Enterprise Application Integreation)**
- 기업에서 운영되는 서로 다른 플랫폼 및 애플리케이션들 간의 정보 전달, 연계, 통합을 가능하게 해주는 솔루션
- 연대성 증대 -> 효율 높임-> 시스템간 확장성 높여줌

*** ESB(Enterprise Service Bus)**
- 기업에서 운영되는 서로 다른 플랫폼 및 애플리케이션들 간의 하나의 시스템으로 관리, 운영할 수 있도록 서비스 중심의 통합을 지향하는 아키텍쳐 또는 기술
***연계 시스템**
- 송신 시스템/ 수신 시스템/ 중계 서버
* 연계 요구사항 주요 분석기법
- 인터뷰/ 체크리스트/ 브레인스토밍/ 설문지/ 델파이 기법

*** 델파이 기법**
- 전문가들의 의견수립, 중재, 타협의 방식으로 반복적인 피드백을 통한 하향식 의견 도출 방법으로 문제를 해결하는 기법

*** WSDL**
- 웹 서비스명, 제공 위치, 메세지 포맷, 프로토콜 정보 등 웹 서비스에 대한 상세 정보를 기술한 파일

*** 인스턴스**
- 객체지향 프로그래밍에서 해당 클래스의 구조로 컴퓨터에 저장 공간에서 할당된 실체

*** SOAP**
- HTTP, HTTPS, SMTP 등을 사용하여 XML기반의 메세지를 네트워크 상태에서 교환하는 프로토콜

*** UDDI**
- 웹 서비스에 대한 정보인 WSDL을 등록하고 검색하기 위한 저장소로 공개적으로 접근, 검색이 가능한 레지스트리

*** JSON**
- 비동기 브라우저/ 서버 통신(AJAX)을 위해 "속성-값 쌍","키-값 쌍" 으로 이루어진 데이터 오브젝트를 전달하기 위해 인간이 읽을 수 있는 텍스트를 사용하는 개방형 표준 포맷

*** EAI(Enterprise Application Integreation)**
- 기업에서 운영되는 서로 다른 플랫폼 및 애플리케이션들 간의 정보 전달, 연계, 통합을 가능하게 해주는 솔루션
- 연대성 증대 -> 효율 높임-> 시스템간 확장성 높여줌

*** ESB(Enterprise Service Bus)**
- 기업에서 운영되는 서로 다른 플랫폼 및 애플리케이션들 간의 하나의 시스템으로 관리, 운영할 수 있도록 서비스 중심의 통합을 지향하는 아키텍쳐 또는 기술
